app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1065]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1116]]
---
    <li class="list-group-item">
      <p class="me-2">Comments: <%= post.comments.size %></p>
      <p>Likes: <%= post.likes.size %></p>