app/views/posts/show.html.erb

        <div class="d-flex">
          <p class="me-2">Comments: <%= @post.comments.size %>,</p>
          <p>Likes: <%= @post.likes.size %></p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 4]]

    <li class="list-group-item">
      <% @post.comments.each do |comment, i| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]