app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("postId", "text", "created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["postId", nil], ["text", "OOPs"], ["created_at", "2022-09-24 13:49:39.669885"], ["updated_at", "2022-09-24 13:49:39.669885"], ["author_id", 5], ["post_id", 4]]