app/controllers/posts_controller.rb

  def index
    @user = User.includes(posts: [:comments]).find(params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4)  [["post_id", 3], ["post_id", 5], ["post_id", 7], ["post_id", 8]]
SELECT DISTINCT "users"."id" FROM "users" LEFT OUTER JOIN "posts" ON "posts"."author_id" = "users"."id" LEFT OUTER JOIN "comments" ON "comments"."post_id" = "posts"."id" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    respond_to do |format|
      format.html do
        if @post.save
---
INSERT INTO "posts" ("title", "text", "commentsCounter", "likesCounter", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"